hotRoom6K_calcs/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// The locations of the sample profiles correspond to:
// Hargreaves-Wright (2007), Fig.6
// DOI:10.1016/j.jweia.2006.08.002

samples
{
    type                    sets;
    libs                    (sampling);
    setFormat               raw;
    interpolationScheme     cell;
    fields                  (U k epsilon nut omega);
    writeControl            writeTime;

    sets
    (
        x_0m    // inlet patch face centres
        {
            type        face;
            axis        y;
            start       (0 0 1.5);
            end         (0 3 1.5);
        }
        x_10m // half way through 
        {
            type        face;
            axis        y;
            start       (10 0 1.5);
            end         (10 3 1.5);
        }
        x_20m // outlet 
        {
            type        face;
            axis        y;
            start       (20 0 1.5);
            end         (20 3 1.5);
        }
    );
}


// *********************************************************************** //
